{
  "backend/main.mo": "Main backend actor implementing production tracking system with user profiles, container types/sizes, production/dispatch entries, daily reports, and access control via MixinAuthorization; includes CRUD operations, statistics queries, and migration support.",
  "backend/migration.mo": "Migration module that initializes default container types (10 types) and sizes (4 sizes) if empty, and applies default values to daily production reports for container_type_id and container_size_id fields.",
  "feature_evidence.json": "Feature evidence report documenting four requirements (REQ-166 to REQ-169) related to DailyProductionReportForm component's container type/size dropdown functionality, validation, and backend query hooks.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing their functionality and role-based access control implementations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, defining colors for UI elements like background, foreground, cards, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Industrial Production Tracker application with Inter font preloaded from Google Fonts and a root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component using TanStack Router with protected routes, authentication via Internet Identity, profile setup modal for new users, and dark theme support via ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with a shield icon for users without admin permissions, providing a logout button that clears authentication and query cache.",
  "frontend/src/components/CircularProgress.tsx": "Renders an animated circular progress indicator showing production completion percentage, with details for produced, target, and remaining quantities.",
  "frontend/src/components/ContainerSizeFilter.tsx": "Provides a dropdown filter for selecting container sizes, fetching options from the backend with loading and error states.",
  "frontend/src/components/ContainerTypeFilter.tsx": "Provides a dropdown filter for selecting container types, fetching options from the backend with loading and error states.",
  "frontend/src/components/DailyProductionReportForm.tsx": "Form component for submitting daily production reports with support for single or batch mode entry across multiple operations, including validation and master order status updates.",
  "frontend/src/components/DailyProductionReportTable.tsx": "Displays a table of daily production reports filtered by date, showing operation names and production metrics with loading states.",
  "frontend/src/components/DateRangeFilter.tsx": "Provides start and end date inputs for filtering data by date range with calendar icons and validation.",
  "frontend/src/components/DispatchEntryForm.tsx": "Form for creating new dispatch entries with fields for container type, quantity, dispatch date, destination, and delivery status.",
  "frontend/src/components/DispatchHistoryTable.tsx": "Displays a table of dispatch records with container type, quantity, destination, and status. Admins can update delivery status via a dialog.",
  "frontend/src/components/EditProductionReportDialog.tsx": "Dialog form for editing production report entries with fields for today's production, total completed, dispatched, and in-hand quantities. Auto-calculates in-hand based on completed minus dispatched.",
  "frontend/src/components/HistoricalOpeningBalanceDisplay.tsx": "Read-only display component showing historical opening balance data including manufacturing start date, system go-live date, and pre-system production/dispatch counts with a locked badge.",
  "frontend/src/components/HistoricalOpeningBalanceForm.tsx": "Admin-only form to create a one-time historical opening balance entry with fixed values for manufacturing start date (2025-08-25), go-live date (2026-02-22), and 344 units manufactured/dispatched before system.",
  "frontend/src/components/Layout.tsx": "Main application layout with collapsible sidebar navigation, logo, route links (Dashboard, Daily Entry, Dispatch, Production History, Opening Balance, Monthly Target, Settings), and user profile display.",
  "frontend/src/components/LiveProductionTable.tsx": "Displays a table of production details for all operations on a given date, showing container type/size, today's production, total completed, dispatched, and in-hand quantities. Supports filtering by container type and size, with visual indicators for operations that have data.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity authentication. Handles authentication state, displays appropriate icons and loading states, and clears the query cache on logout.",
  "frontend/src/components/MasterOrderProgressSection.tsx": "Displays master order status with a circular progress indicator and summary cards showing total manufactured, dispatched, remaining to produce, and finished stock. Includes real-time refresh indicators and completion badges.",
  "frontend/src/components/MasterOrderUpdateForm.tsx": "Admin-only form for updating master order totals (manufactured and dispatched quantities). Includes validation to prevent negative values and ensure dispatched doesn't exceed manufactured, with live calculation of derived metrics.",
  "frontend/src/components/OperationComparisonChart.tsx": "Renders a bar chart comparing total completed units across different operations using Recharts. Supports filtering by container type and size with gradient-styled bars and responsive layout.",
  "frontend/src/components/OperationWorkloadView.tsx": "Displays a grid of cards showing pending workload for each operation with progress bars and capacity indicators. Falls back to placeholder operations (Cutting, Welding, Assembly, Painting) when no data is available.",
  "frontend/src/components/ProductionDashboard.tsx": "Displays production overview dashboard with summary cards showing total production, container statuses (ready for dispatch, pending operations, under testing), and breakdowns by container type and status using data from production stats and container status queries.",
  "frontend/src/components/ProductionEntryForm.tsx": "Form component for creating new production entries with fields for container type, total quantity, shift details (name, ID, container quantity), and status, with form reset on successful submission.",
  "frontend/src/components/ProductionHistoryDetailTable.tsx": "Displays detailed production history table filtered by date range, container type, and size, showing daily production reports with operation details, quantities (today's production, total completed, dispatched, in hand), and admin edit functionality.",
  "frontend/src/components/ProductionHistoryTable.tsx": "Shows filterable production history table with container type and status filters, displaying entries with formatted dates, status badges, shift details, and quantities in a card layout.",
  "frontend/src/components/ProductionTrendChart.tsx": "Renders a line chart showing daily production trends over time using Recharts, with optional filtering by container type/size and support for displaying historical opening balance as a baseline data point.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for first-time user profile setup, requiring name and department input before allowing access to the application.",
  "frontend/src/components/SummaryCard.tsx": "A reusable card component that displays a metric with an icon, animated numeric value, optional description and trend indicator. Features hover effects, gradient backgrounds, and smooth number animations using requestAnimationFrame.",
  "frontend/src/components/TypeWiseProductionSummary.tsx": "Displays production summary grouped by container type, showing today's production, total completed, dispatched, and in-hand quantities. Renders a grid of animated cards with loading states and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state and initializing access control. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates and manages AuthClient with configurable options and exposes authentication state and methods throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including user profiles, container types/sizes, production entries, dispatch entries, and statistics. Handles mutations with toast notifications and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a premium industrial dark theme. Defines color variables using OKLCH color space, glass morphism effects, metallic borders, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/DailyProductionReportPage.tsx": "Admin-only page for recording daily production reports, displaying a form and table. Shows access denied screen for non-admin users with loading state handling.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that renders the ProductionDashboard component with a title and description for real-time manufacturing operations overview.",
  "frontend/src/pages/DispatchTrackingPage.tsx": "Page for dispatch tracking that shows entry form for admins and history table for all users. Conditionally renders form based on admin status with appropriate messaging.",
  "frontend/src/pages/HistoricalOpeningBalancePage.tsx": "Page component that displays or allows admin users to set the historical opening balance for production data, showing a form for admins if no balance exists, a display component if balance exists, or access denied for non-admin users.",
  "frontend/src/pages/LoginPage.tsx": "Login page component with Internet Identity authentication, featuring a centered glass-card design with shipping container logo and login button with loading states.",
  "frontend/src/pages/OperationWorkloadPage.tsx": "Simple page wrapper that renders the OperationWorkloadView component to display current work-in-hand status across manufacturing operations.",
  "frontend/src/pages/ProductionDashboardLivePage.tsx": "Live production dashboard page with date selection, container type/size filters, summary cards for production metrics, master order progress, type-wise production summary, and production trend/comparison charts with auto-refresh indicators.",
  "frontend/src/pages/ProductionEntryPage.tsx": "Admin-only page for entering production data, showing ProductionEntryForm for admins or AccessDeniedScreen for non-admin users.",
  "frontend/src/pages/ProductionHistoryPage.tsx": "Production history page with 30-day default date range filter, displaying ProductionHistoryDetailTable with read-only notice for non-admin users and edit capabilities for admins.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom dark theme colors using OKLCH color space, extended design tokens for industrial SaaS UI (navy, electric-blue, etc.), custom animations, shadows, and typography/container-query plugins.",
  "project_state.json": "Project state metadata documenting the shipping container manufacturing tracking application architecture, including 17 tracked operations, role-based access control, dark industrial theme, and implemented features with requirement IDs."
}