{
  "backend/main.mo": "Main Motoko actor implementing a production tracking system with user authentication, role-based access control (Admin/Viewer), production entries, dispatch tracking, daily production reports, and operation workload management with migration support.",
  "backend/migration.mo": "Migration module that transforms old user profiles without roles into new profiles with a default Admin role assignment.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing their functionality and role-based access control implementation.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point for the Industrial Production Tracker application with viewport meta tag and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes, Internet Identity authentication, profile setup modal, theme provider, and navigation to all production tracking pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied UI component displaying a shield alert icon and message for users without Admin permissions, with logout functionality.",
  "frontend/src/components/DailyProductionReportForm.tsx": "Admin form component for submitting daily production reports with date picker, operation dropdown, numeric inputs for production metrics, and auto-calculated In Hand field.",
  "frontend/src/components/DailyProductionReportTable.tsx": "Table component displaying daily production reports filtered by date with columns for operation name, today's production, total completed, despatched, and in-hand quantities.",
  "frontend/src/components/DateRangeFilter.tsx": "A card-based date range filter component with start and end date inputs, displaying the selected range and enforcing min/max constraints between dates.",
  "frontend/src/components/DispatchEntryForm.tsx": "A form component for creating new dispatch entries with fields for container type, quantity, dispatch date, destination, and delivery status, using mutation hooks to submit data.",
  "frontend/src/components/DispatchHistoryTable.tsx": "Displays a table of dispatch records with container type, quantity, destination, date, and status; includes admin-only dialog for updating delivery status.",
  "frontend/src/components/EditProductionReportDialog.tsx": "A dialog component for editing production report entries with validation, allowing updates to today's production, total completed, and despatched values while auto-calculating in-hand inventory.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, responsive navigation (desktop and mobile), logo, and login button; wraps page content and highlights active routes.",
  "frontend/src/components/LiveProductionTable.tsx": "Displays a table of daily production reports by operation, showing today's production, total completed, despatched, and in-hand quantities with loading skeleton states.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/OperationComparisonChart.tsx": "Renders a bar chart comparing production quantities across different operations using Recharts, with loading/error states and color-coded bars.",
  "frontend/src/components/OperationWorkloadView.tsx": "Displays a grid of cards showing pending workload counts for each operation (Cutting, Welding, Assembly, Painting) with progress bars and icons.",
  "frontend/src/components/ProductionDashboard.tsx": "Main dashboard component showing summary cards for total production, dispatch status, and pending operations, plus breakdowns by container type and status.",
  "frontend/src/components/ProductionEntryForm.tsx": "Form component for creating new production entries with fields for container type, quantity, shift details, and status.",
  "frontend/src/components/ProductionHistoryDetailTable.tsx": "Table displaying detailed production history by date range with columns for operation, production metrics, and optional admin edit actions.",
  "frontend/src/components/ProductionHistoryTable.tsx": "Filterable table showing production entry history with filters for container type and status, displaying formatted dates and status badges.",
  "frontend/src/components/ProductionTrendChart.tsx": "Displays a line chart showing daily total production output across all operations using Recharts, with loading, error, and empty states.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup, collecting name, department, and role (Admin/Viewer) with form validation.",
  "frontend/src/components/SummaryCard.tsx": "Reusable card component displaying a metric with title, value, icon, optional description, and optional trend indicator.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance with Internet Identity authentication, handling actor creation and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating production data, user profiles, dispatch entries, and container statuses with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom industrial-themed color palette for light and dark modes, plus mobile-friendly input styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers, then rendering the root App component.",
  "frontend/src/pages/DailyProductionReportPage.tsx": "Page displaying daily production report form (admin-only) and report table, with role-based access control and loading states.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page with title and description, rendering the ProductionDashboard component for real-time operations overview.",
  "frontend/src/pages/DispatchTrackingPage.tsx": "Dispatch tracking page that shows DispatchEntryForm for admins and DispatchHistoryTable for all users, with role-based access control checking if user is Admin.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying Internet Identity authentication UI with Factory icon, app description, and login button with loading states.",
  "frontend/src/pages/OperationWorkloadPage.tsx": "Simple page wrapper that renders the OperationWorkloadView component with a title and description for viewing current work-in-hand status across manufacturing operations.",
  "frontend/src/pages/ProductionDashboardLivePage.tsx": "Main dashboard page displaying live production metrics including monthly target progress (100 containers), daily production summary, production trend charts, and operation comparison charts with real-time data.",
  "frontend/src/pages/ProductionEntryPage.tsx": "Admin-only page for entering production data, displays ProductionEntryForm with role-based access control that shows AccessDeniedScreen for non-admin users.",
  "frontend/src/pages/ProductionHistoryPage.tsx": "Production history page with date range filtering (default last 30 days) and ProductionHistoryDetailTable, showing read-only notice for non-admin users while allowing admins to edit records.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including chart colors, container queries, typography plugin, and custom animations for accordion components.",
  "project_state.json": "Project state document describing a responsive industrial production tracking web app for shipping container manufacturing with 17 operations tracked, role-based access control, monthly targets of 100 containers, and complete feature implementation status."
}