{
  "backend/main.mo": "Main backend actor implementing production tracking system with user profiles, production/dispatch entries, daily reports, master order status, and historical opening balance; includes authorization mixin and migration support.",
  "backend/migration.mo": "Migration module that transforms old user profiles (with role field) to new user profiles (without role field) by mapping over the userProfiles Map.",
  "feature_evidence.json": "Feature evidence report documenting implementation of historical opening balance functionality including React Query hooks, form component, and display component with associated test IDs.",
  "frontend-file-summaries.txt": "Text file containing summaries of all frontend components, pages, and configuration files describing their purpose and key features in the production tracking application.",
  "frontend/index.css": "Tailwind CSS configuration with base layer defining CSS custom properties for light and dark themes using OKLCH color space for consistent color management.",
  "frontend/index.html": "HTML entry point for the Industrial Production Tracker application with Inter font preloading and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup defining routes for dashboard, production entry, dispatch tracking, operation workload, daily reports, and opening balance; includes authentication and profile setup logic.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component displaying an access denied message with shield icon and logout button for users without admin permissions.",
  "frontend/src/components/CircularProgress.tsx": "Displays an animated circular progress indicator with percentage completion, showing produced, target, and remaining values in a glass-card styled component.",
  "frontend/src/components/DailyProductionReportForm.tsx": "Admin form for submitting or updating daily production reports with fields for date, operation name, production metrics, and auto-calculated in-hand inventory.",
  "frontend/src/components/DailyProductionReportTable.tsx": "Displays a filterable table of daily production reports by date, showing operation names and production metrics with loading states.",
  "frontend/src/components/DateRangeFilter.tsx": "Reusable date range filter component with start and end date inputs for filtering data within a specified period.",
  "frontend/src/components/DispatchEntryForm.tsx": "Form for creating new dispatch entries with container type, quantity, dispatch date, destination, and delivery status fields.",
  "frontend/src/components/DispatchHistoryTable.tsx": "Displays dispatch history in a table with admin-only status update functionality via a dialog, showing container types, quantities, destinations, and delivery status.",
  "frontend/src/components/EditProductionReportDialog.tsx": "A dialog component for editing production report entries with form validation, allowing users to update today's production, total completed, and dispatched values while automatically calculating in-hand inventory.",
  "frontend/src/components/HistoricalOpeningBalanceDisplay.tsx": "Displays a locked historical opening balance entry showing manufacturing start date, system go-live date, and pre-system production/dispatch metrics in a read-only card layout.",
  "frontend/src/components/HistoricalOpeningBalanceForm.tsx": "Admin-only form component for creating a one-time historical opening balance entry with fixed values for manufacturing start date, system go-live date, and pre-system production data.",
  "frontend/src/components/Layout.tsx": "Main application layout component with collapsible sidebar navigation, mobile menu support, and user profile display, providing routing to dashboard, production, dispatch, and settings pages.",
  "frontend/src/components/LiveProductionTable.tsx": "Displays a table of daily production reports by operation, showing today's production, total completed, dispatched, and in-hand quantities for a selected date.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MasterOrderProgressSection.tsx": "Displays master order progress with circular progress chart and summary cards showing total manufactured, dispatched, remaining to produce, and finished stock quantities. Fetches data from useGetMasterOrderStatus hook and handles loading/error states.",
  "frontend/src/components/MasterOrderUpdateForm.tsx": "Admin-only form for updating master order status (total manufactured and dispatched quantities). Includes validation to prevent negative values and ensure dispatched doesn't exceed manufactured, with real-time calculated metrics display.",
  "frontend/src/components/OperationComparisonChart.tsx": "Renders a bar chart comparing production quantities across different operations using Recharts. Displays operation-wise production data with gradient-styled bars and handles loading/error states.",
  "frontend/src/components/OperationWorkloadView.tsx": "Displays a grid of cards showing pending workload for each operation (Cutting, Welding, Assembly, Painting) with progress bars and capacity indicators. Falls back to placeholder operations if no data is available.",
  "frontend/src/components/ProductionDashboard.tsx": "Main dashboard showing production statistics with summary cards for total production, ready for dispatch, pending operations, and under testing containers. Includes breakdowns by container type and status overview.",
  "frontend/src/components/ProductionEntryForm.tsx": "Form component for creating new production entries with fields for container type, quantities, shift details, and status. Resets form on successful submission and validates required fields.",
  "frontend/src/components/ProductionHistoryDetailTable.tsx": "Displays a detailed table of production history filtered by date range, showing daily production reports with columns for date, operation, production metrics, and an admin-only edit button that opens EditProductionReportDialog.",
  "frontend/src/components/ProductionHistoryTable.tsx": "Renders a filterable production history table with container type and status filters, displaying production entries with formatted dates, status badges, and container type labels.",
  "frontend/src/components/ProductionTrendChart.tsx": "Displays a line chart showing daily total production output across all operations using Recharts, with support for including historical opening balance as the first data point.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog that prompts users to set up their profile by entering their name and department, preventing dismissal until completed.",
  "frontend/src/components/SummaryCard.tsx": "A reusable card component that displays a metric with an icon, animated numeric value, optional description and trend indicator, featuring hover effects and gradient styling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, production entries, dispatch entries, daily reports, monthly summaries, master orders, and historical opening balances. Handles query caching, mutations, and toast notifications for success/error states.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a premium industrial dark theme using OKLCH color space, including CSS custom properties for light/dark modes, gradient backgrounds, glass effects, metallic borders, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/DailyProductionReportPage.tsx": "Page for viewing and creating daily production reports, conditionally showing the form only to admin users while allowing all users to view the report table.",
  "frontend/src/pages/DashboardPage.tsx": "Simple page wrapper that renders the ProductionDashboard component with a title and description for real-time container manufacturing operations overview.",
  "frontend/src/pages/DispatchTrackingPage.tsx": "Page for dispatch tracking that shows the entry form only to admins and displays dispatch history table to all users with appropriate access control messaging.",
  "frontend/src/pages/HistoricalOpeningBalancePage.tsx": "Page that displays historical opening balance if it exists, shows a form to admins if not set, or denies access to non-admins when no balance exists.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, featuring a glass-morphism design with company branding and loading states during authentication.",
  "frontend/src/pages/OperationWorkloadPage.tsx": "Simple page wrapper that renders the OperationWorkloadView component showing current work-in-hand status across manufacturing operations.",
  "frontend/src/pages/ProductionDashboardLivePage.tsx": "Comprehensive live production dashboard displaying today's metrics, monthly summaries, master order progress, summary cards, live production table, and analytics charts with opening balance context.",
  "frontend/src/pages/ProductionEntryPage.tsx": "Admin-only page for creating production entries, showing access denied screen to non-admin users.",
  "frontend/src/pages/ProductionHistoryPage.tsx": "Page displaying production history with date range filtering, showing read-only notice to non-admins while allowing admins to edit records.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed industrial SaaS design system with custom OKLCH colors (navy, electric-blue, industrial-green), extended utilities for shadows/animations, and typography/container-query plugins.",
  "project_state.json": "Project state document describing a production tracking web application for shipping container manufacturing with 17 tracked operations, role-based access control, dark industrial theme, and features including daily data entry, dashboard, history filtering, dispatch tracking, and Master Order Progress system."
}